run/solidification/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       5870;
    }
    left
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          30;
        startFace       5970;
    }
    right
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          30;
        startFace       6000;
    }
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       6030;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       6130;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       6130;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          6000;
        startFace       6130;
    }
)

// ************************************************************************* //
